irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_gpio_3331_IUT.c
  CS_CMM_PROBE_NODE_STMT(104,3,1) if (GPIOx == ((GPIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0800)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable490,481) 
    
    CS_CMM_PROBE_NODE_STMT(104,2,2) RCC_APB2PeriphResetCmd(((uint32_t)0x00000004), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00000004), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(104,1,3) if (GPIOx == ((GPIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0C00)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable491,482) 
    
    CS_CMM_PROBE_NODE_STMT(104,0,4) RCC_APB2PeriphResetCmd(((uint32_t)0x00000008), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00000008), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(105,7,5) if (GPIOx == ((GPIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x1000)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable492,483) 
    
    CS_CMM_PROBE_NODE_STMT(105,6,6) RCC_APB2PeriphResetCmd(((uint32_t)0x00000010), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00000010), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(105,5,7) if (GPIOx == ((GPIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x1400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable493,484) 
    
    CS_CMM_PROBE_NODE_STMT(105,4,8) RCC_APB2PeriphResetCmd(((uint32_t)0x00000020), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00000020), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(105,3,9) if (GPIOx == ((GPIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x1800)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable494,485) 
    
    CS_CMM_PROBE_NODE_STMT(105,2,10) RCC_APB2PeriphResetCmd(((uint32_t)0x00000040), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00000040), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(105,1,11) if (GPIOx == ((GPIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x1C00)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable495,486) 
    
    CS_CMM_PROBE_NODE_STMT(105,0,12) RCC_APB2PeriphResetCmd(((uint32_t)0x00000080), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00000080), DISABLE);
  }
  else
  {
    
    CS_CMM_PROBE_NODE_STMT(106,7,13) if (GPIOx == ((GPIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2000)))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable496,487) 
      
      CS_CMM_PROBE_NODE_STMT(106,6,14) RCC_APB2PeriphResetCmd(((uint32_t)0x00000100), ENABLE);
      RCC_APB2PeriphResetCmd(((uint32_t)0x00000100), DISABLE);
    } CS_CMM_ELSE_PROBE_C1(488) 
  }
  }
  }
  }
  }
  }

CS_CMM_PROBE_NODE_STMT(106,5,15) 
 CODESCROLL_FUNC_END(173, 13, 150) } CODESCROLL_FUNC_END_RBRACE 







void GPIO_AFIODeInit(void)
{ CODESCROLL_FUNC_BEGIN(174, (174, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable497,489) 
  
  CS_CMM_PROBE_NODE_STMT(106,4,0) RCC_APB2PeriphResetCmd(((uint32_t)0x00000001), ENABLE);
  RCC_APB2PeriphResetCmd(((uint32_t)0x00000001), DISABLE);

CS_CMM_PROBE_NODE_STMT(106,3,1) 
 CODESCROLL_FUNC_END(174, 13, 162) } CODESCROLL_FUNC_END_RBRACE 
/* # 172 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_Init(GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_InitStruct)
{ CODESCROLL_FUNC_BEGIN(175, (175, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable498,490) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable499,106,2,0)

  uint32_t currentmode = 0x00, currentpin = 0x00, pinpos = 0x00, pos = 0x00;
  uint32_t tmpreg = 0x00, pinmask = 0x00;

  ((void)0);
  ((void)0);
  ((void)0);


  currentmode = ((uint32_t)GPIO_InitStruct->GPIO_Mode) & ((uint32_t)0x0F);
  
  CS_CMM_PROBE_NODE_STMT(106,1,1) if ((((uint32_t)GPIO_InitStruct->GPIO_Mode) & ((uint32_t)0x10)) != 0x00)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable500,491) 

    
    CS_CMM_PROBE_NODE_STMT(106,0,2) ((void)0);

    currentmode |= (uint32_t)GPIO_InitStruct->GPIO_Speed;
  } CS_CMM_ELSE_PROBE_C1(492) 


  
  CS_CMM_PROBE_NODE_STMT(107,7,3) if (((uint32_t)GPIO_InitStruct->GPIO_Pin & ((uint32_t)0x00FF)) != 0x00)
  {
    
    CS_CMM_PROBE_NODE_STMT(107,6,4) tmpreg = GPIOx->CRL;
    
    CS_CMM_PROBE_NODE_STMT(107,5,5) for (pinpos = 0x00; CS_CMM_PROBE_NODE_EXPR(107,4,6)  pinpos < 0x08; CS_CMM_PROBE_NODE_EXPR(107,3,7)  pinpos++)
    {
      
      CS_CMM_PROBE_NODE_STMT(107,2,8) pos = ((uint32_t)0x01) << pinpos;

      currentpin = (GPIO_InitStruct->GPIO_Pin) & pos;
      
      CS_CMM_PROBE_NODE_STMT(107,1,9) if (currentpin == pos)
      {
        
        CS_CMM_PROBE_NODE_STMT(107,0,10) pos = pinpos << 2;

        pinmask = ((uint32_t)0x0F) << pos;
        tmpreg &= ~pinmask;

        tmpreg |= (currentmode << pos);

        
        CS_CMM_PROBE_NODE_STMT(108,7,11) if (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_IPD)
        { CS_CMM_PROBE_DECL_C1(CodeScrollVariable501,493) 
          
          CS_CMM_PROBE_NODE_STMT(108,6,12) GPIOx->BRR = (((uint32_t)0x01) << pinpos);
        }
        else
        {

          
          CS_CMM_PROBE_NODE_STMT(108,5,13) if (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_IPU)
          { CS_CMM_PROBE_DECL_C1(CodeScrollVariable502,494) 
            
            CS_CMM_PROBE_NODE_STMT(108,4,14) GPIOx->BSRR = (((uint32_t)0x01) << pinpos);
          } CS_CMM_ELSE_PROBE_C1(495) 
        }
      } CS_CMM_ELSE_PROBE_C1(496) 
    } CS_CMM_PROBE_C1(497) CS_CMM_LABEL(cs_cmm_for_end_175_6) 
    
    CS_CMM_PROBE_NODE_STMT(108,3,15) GPIOx->CRL = tmpreg;
  } CS_CMM_ELSE_PROBE_C1(498) 


  
  CS_CMM_PROBE_NODE_STMT(108,2,16) if (GPIO_InitStruct->GPIO_Pin > 0x00FF)
  {
    
    CS_CMM_PROBE_NODE_STMT(108,1,17) tmpreg = GPIOx->CRH;
    
    CS_CMM_PROBE_NODE_STMT(108,0,18) for (pinpos = 0x00; CS_CMM_PROBE_NODE_EXPR(109,7,19)  pinpos < 0x08; CS_CMM_PROBE_NODE_EXPR(109,6,20)  pinpos++)
    {
      
      CS_CMM_PROBE_NODE_STMT(109,5,21) pos = (((uint32_t)0x01) << (pinpos + 0x08));

      currentpin = ((GPIO_InitStruct->GPIO_Pin) & pos);
      
      CS_CMM_PROBE_NODE_STMT(109,4,22) if (currentpin == pos)
      {
        
        CS_CMM_PROBE_NODE_STMT(109,3,23) pos = pinpos << 2;

        pinmask = ((uint32_t)0x0F) << pos;
        tmpreg &= ~pinmask;

        tmpreg |= (currentmode << pos);

        
        CS_CMM_PROBE_NODE_STMT(109,2,24) if (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_IPD)
        { CS_CMM_PROBE_DECL_C1(CodeScrollVariable503,499) 
          
          CS_CMM_PROBE_NODE_STMT(109,1,25) GPIOx->BRR = (((uint32_t)0x01) << (pinpos + 0x08));
        } CS_CMM_ELSE_PROBE_C1(500) 

        
