irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_gpio_3331_IUT.c
        CS_CMM_PROBE_NODE_STMT(109,0,26) if (GPIO_InitStruct->GPIO_Mode == GPIO_Mode_IPU)
        { CS_CMM_PROBE_DECL_C1(CodeScrollVariable504,501) 
          
          CS_CMM_PROBE_NODE_STMT(110,7,27) GPIOx->BSRR = (((uint32_t)0x01) << (pinpos + 0x08));
        } CS_CMM_ELSE_PROBE_C1(502) 
      } CS_CMM_ELSE_PROBE_C1(503) 
    } CS_CMM_PROBE_C1(504) CS_CMM_LABEL(cs_cmm_for_end_175_19) 
    
    CS_CMM_PROBE_NODE_STMT(110,6,28) GPIOx->CRH = tmpreg;
  } CS_CMM_ELSE_PROBE_C1(505) 

CS_CMM_PROBE_NODE_STMT(110,5,29) 
 CODESCROLL_FUNC_END(175, 13, 257) } CODESCROLL_FUNC_END_RBRACE 







void GPIO_StructInit(GPIO_InitTypeDef* GPIO_InitStruct)
{ CODESCROLL_FUNC_BEGIN(176, (176, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable505,506) 

  
  CS_CMM_PROBE_NODE_STMT(110,4,0) GPIO_InitStruct->GPIO_Pin = ((uint16_t)0xFFFF);
  GPIO_InitStruct->GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStruct->GPIO_Mode = GPIO_Mode_IN_FLOATING;

CS_CMM_PROBE_NODE_STMT(110,3,1) 
 CODESCROLL_FUNC_END(176, 13, 271) } CODESCROLL_FUNC_END_RBRACE 
/* # 280 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
uint8_t GPIO_ReadInputDataBit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{ CODESCROLL_FUNC_BEGIN(177, (177, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable506,507) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable507,110,2,0)

  uint8_t bitstatus = 0x00;


  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(110,1,1) if ((GPIOx->IDR & GPIO_Pin) != (uint32_t)Bit_RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable508,508) 
    
    CS_CMM_PROBE_NODE_STMT(110,0,2) bitstatus = (uint8_t)Bit_SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable509,509) 
    
    CS_CMM_PROBE_NODE_STMT(111,7,3) bitstatus = (uint8_t)Bit_RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(111,6,4) 
   CODESCROLL_FUNC_END(177, 13, 296) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t GPIO_ReadInputData(GPIO_TypeDef* GPIOx)
{ CODESCROLL_FUNC_BEGIN(178, (178, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable510,510) 

  
  CS_CMM_PROBE_NODE_STMT(111,5,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(111,4,1) 
   CODESCROLL_FUNC_END(178, 13, 309) return ((uint16_t)GPIOx->IDR);
} CODESCROLL_FUNC_END_RBRACE 
/* # 319 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
uint8_t GPIO_ReadOutputDataBit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{ CODESCROLL_FUNC_BEGIN(179, (179, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable511,511) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable512,111,3,0)

  uint8_t bitstatus = 0x00;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(111,2,1) if ((GPIOx->ODR & GPIO_Pin) != (uint32_t)Bit_RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable513,512) 
    
    CS_CMM_PROBE_NODE_STMT(111,1,2) bitstatus = (uint8_t)Bit_SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable514,513) 
    
    CS_CMM_PROBE_NODE_STMT(111,0,3) bitstatus = (uint8_t)Bit_RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(112,7,4) 
   CODESCROLL_FUNC_END(179, 13, 334) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t GPIO_ReadOutputData(GPIO_TypeDef* GPIOx)
{ CODESCROLL_FUNC_BEGIN(180, (180, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable515,514) 

  
  CS_CMM_PROBE_NODE_STMT(112,6,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(112,5,1) 
   CODESCROLL_FUNC_END(180, 13, 347) return ((uint16_t)GPIOx->ODR);
} CODESCROLL_FUNC_END_RBRACE 
/* # 357 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_SetBits(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{ CODESCROLL_FUNC_BEGIN(181, (181, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable516,515) 

  
  CS_CMM_PROBE_NODE_STMT(112,4,0) ((void)0);
  ((void)0);

  GPIOx->BSRR = GPIO_Pin;

CS_CMM_PROBE_NODE_STMT(112,3,1) 
 CODESCROLL_FUNC_END(181, 13, 364) } CODESCROLL_FUNC_END_RBRACE 
/* # 373 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_ResetBits(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{ CODESCROLL_FUNC_BEGIN(182, (182, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable517,516) 

  
  CS_CMM_PROBE_NODE_STMT(112,2,0) ((void)0);
  ((void)0);

  GPIOx->BRR = GPIO_Pin;

CS_CMM_PROBE_NODE_STMT(112,1,1) 
 CODESCROLL_FUNC_END(182, 13, 380) } CODESCROLL_FUNC_END_RBRACE 
/* # 393 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_WriteBit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, BitAction BitVal)
{ CODESCROLL_FUNC_BEGIN(183, (183, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable518,517) 

  
  CS_CMM_PROBE_NODE_STMT(112,0,0) ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(113,7,1) if (BitVal != Bit_RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable519,518) 
    
    CS_CMM_PROBE_NODE_STMT(113,6,2) GPIOx->BSRR = GPIO_Pin;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable520,519) 
    
    CS_CMM_PROBE_NODE_STMT(113,5,3) GPIOx->BRR = GPIO_Pin;
  }

CS_CMM_PROBE_NODE_STMT(113,4,4) 
 CODESCROLL_FUNC_END(183, 13, 408) } CODESCROLL_FUNC_END_RBRACE 







void GPIO_Write(GPIO_TypeDef* GPIOx, uint16_t PortVal)
{ CODESCROLL_FUNC_BEGIN(184, (184, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable521,520) 

  
  CS_CMM_PROBE_NODE_STMT(113,3,0) ((void)0);

  GPIOx->ODR = PortVal;

CS_CMM_PROBE_NODE_STMT(113,2,1) 
 CODESCROLL_FUNC_END(184, 13, 422) } CODESCROLL_FUNC_END_RBRACE 
/* # 431 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_PinLockConfig(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{ CODESCROLL_FUNC_BEGIN(185, (185, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable522,521) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable523,113,1,0)

