irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_gpio_3331_IUT.c
  uint32_t tmp = 0x00010000;


  ((void)0);
  ((void)0);

  tmp |= GPIO_Pin;

  GPIOx->LCKR = tmp;

  GPIOx->LCKR = GPIO_Pin;

  GPIOx->LCKR = tmp;

  tmp = GPIOx->LCKR;

  tmp = GPIOx->LCKR;

CS_CMM_PROBE_NODE_STMT(113,0,1) 
 CODESCROLL_FUNC_END(185, 13, 450) } CODESCROLL_FUNC_END_RBRACE 
/* # 461 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_EventOutputConfig(uint8_t GPIO_PortSource, uint8_t GPIO_PinSource)
{ CODESCROLL_FUNC_BEGIN(186, (186, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable524,522) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable525,114,7,0)

  uint32_t tmpreg = 0x00;

  ((void)0);
  ((void)0);

  tmpreg = ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->EVCR;

  tmpreg &= ((uint16_t)0xFF80);
  tmpreg |= (uint32_t)GPIO_PortSource << 0x04;
  tmpreg |= GPIO_PinSource;
  ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->EVCR = tmpreg;

CS_CMM_PROBE_NODE_STMT(114,6,1) 
 CODESCROLL_FUNC_END(186, 13, 474) } CODESCROLL_FUNC_END_RBRACE 







void GPIO_EventOutputCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(187, (187, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable526,523) 

  
  CS_CMM_PROBE_NODE_STMT(114,5,0) ((void)0);

  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x10000) + 0x0000) - ((uint32_t)0x40000000)) + 0x00) * 32) + (((uint8_t)0x07) * 4)) = (uint32_t)NewState;

CS_CMM_PROBE_NODE_STMT(114,4,1) 
 CODESCROLL_FUNC_END(187, 13, 488) } CODESCROLL_FUNC_END_RBRACE 
/* # 541 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_PinRemapConfig(uint32_t GPIO_Remap, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(188, (188, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable527,524) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable528,114,3,0)

  uint32_t tmp = 0x00, tmp1 = 0x00, tmpreg = 0x00, tmpmask = 0x00;


  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(114,2,1) if((GPIO_Remap & 0x80000000) == 0x80000000)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable529,525) 
    
    CS_CMM_PROBE_NODE_STMT(114,1,2) tmpreg = ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->MAPR2;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable530,526) 
    
    CS_CMM_PROBE_NODE_STMT(114,0,3) tmpreg = ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->MAPR;
  }

  
  CS_CMM_PROBE_NODE_STMT(115,7,4) tmpmask = (GPIO_Remap & ((uint32_t)0x000F0000)) >> 0x10;
  tmp = GPIO_Remap & ((uint16_t)0xFFFF);

  
  CS_CMM_PROBE_NODE_STMT(115,6,5) if ((GPIO_Remap & (((uint32_t)0x00200000) | ((uint32_t)0x00100000))) == (((uint32_t)0x00200000) | ((uint32_t)0x00100000)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable531,527) 
    
    CS_CMM_PROBE_NODE_STMT(115,5,6) tmpreg &= ((uint32_t)0xF0FFFFFF);
    ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->MAPR &= ((uint32_t)0xF0FFFFFF);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(115,4,7) if ((GPIO_Remap & ((uint32_t)0x00100000)) == ((uint32_t)0x00100000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable532,528) 
    
    CS_CMM_PROBE_NODE_STMT(115,3,8) tmp1 = ((uint32_t)0x03) << tmpmask;
    tmpreg &= ~tmp1;
    tmpreg |= ~((uint32_t)0xF0FFFFFF);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable533,529) 
    
    CS_CMM_PROBE_NODE_STMT(115,2,9) tmpreg &= ~(tmp << ((GPIO_Remap >> 0x15)*0x10));
    tmpreg |= ~((uint32_t)0xF0FFFFFF);
  }
  }

  
  CS_CMM_PROBE_NODE_STMT(115,1,10) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable534,530) 
    
    CS_CMM_PROBE_NODE_STMT(115,0,11) tmpreg |= (tmp << ((GPIO_Remap >> 0x15)*0x10));
  } CS_CMM_ELSE_PROBE_C1(531) 

  
  CS_CMM_PROBE_NODE_STMT(116,7,12) if((GPIO_Remap & 0x80000000) == 0x80000000)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable535,532) 
    
    CS_CMM_PROBE_NODE_STMT(116,6,13) ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->MAPR2 = tmpreg;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable536,533) 
    
    CS_CMM_PROBE_NODE_STMT(116,5,14) ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->MAPR = tmpreg;
  }

CS_CMM_PROBE_NODE_STMT(116,4,15) 
 CODESCROLL_FUNC_END(188, 13, 591) } CODESCROLL_FUNC_END_RBRACE 
/* # 601 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_EXTILineConfig(uint8_t GPIO_PortSource, uint8_t GPIO_PinSource)
{ CODESCROLL_FUNC_BEGIN(189, (189, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable537,534) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable538,116,3,0)

  uint32_t tmp = 0x00;

  ((void)0);
  ((void)0);

  tmp = ((uint32_t)0x0F) << (0x04 * (GPIO_PinSource & (uint8_t)0x03));
  ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->EXTICR[GPIO_PinSource >> 0x02] &= ~tmp;
  ((AFIO_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x0000))->EXTICR[GPIO_PinSource >> 0x02] |= (((uint32_t)GPIO_PortSource) << (0x04 * (GPIO_PinSource & (uint8_t)0x03)));

CS_CMM_PROBE_NODE_STMT(116,2,1) 
 CODESCROLL_FUNC_END(189, 13, 611) } CODESCROLL_FUNC_END_RBRACE 
/* # 622 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_gpio.c"*/
void GPIO_ETH_MediaInterfaceConfig(uint32_t GPIO_ETH_MediaInterface)
{ CODESCROLL_FUNC_BEGIN(190, (190, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable539,535) 
  
  CS_CMM_PROBE_NODE_STMT(116,1,0) ((void)0);


  *(volatile uint32_t *) (((uint32_t)0x42000000) + (((((((uint32_t)0x40000000) + 0x10000) + 0x0000) - ((uint32_t)0x40000000)) + 0x04) * 32) + (((u8)0x17) * 4)) = GPIO_ETH_MediaInterface;

CS_CMM_PROBE_NODE_STMT(116,0,1) 
 CODESCROLL_FUNC_END(190, 13, 628) } CODESCROLL_FUNC_END_RBRACE 
